![title](./pic/merging/left_join/1_title.png)

In [17]:
import pandas as pd
import time
from IPython.display import Image

In [29]:
df_ids = pd.read_csv('./csv/merge_function/df_ids.csv', index_col=0)
df_passenger = pd.read_csv('./csv/merge_function/df_passenger.csv', index_col=0)

---

## Merge function: `left_join` mit `on=`

![title](./pic/merging/left_join/2_left_on.png)

<video width="1000" controls src="./pic/merging/left_join/3_left_example.mp4" />

In [21]:
df_passenger.head()

   PassengerId                                       Name     Sex
0          935      Corbett, Mrs. Walter H (Irene Colvin)  female
1         1023                  Gracie, Col. Archibald IV    male
2         1136  Johnston, Master. William Arthur Willie""    male
3         1044                         Storey, Mr. Thomas    male
4          954               Bjorklund, Mr. Ernst Herbert    male

In [22]:
df_ids.head()

   PassengerId  Survived
0         1297         0
1         1260         1
2         1153         0
3         1139         0
4          998         0

In [23]:
pd.merge(df_ids,
         df_passenger,
         how='left',
         on='PassengerId'
         )

,PassengerId,Survived,Name,Sex
0,1297,0,"Nourney, Mr. Alfred (Baron von Drachstedt"")""",male
1,1260,1,"Gibson, Mrs. Leonard (Pauline C Boeson)",female
2,1153,0,"Nilsson, Mr. August Ferdinand",male
3,1139,0,"Drew, Mr. James Vivian",male
4,998,0,"Buckley, Mr. Daniel",male
...,...,...,...,...
428,1149,0,"Niklasson, Mr. Samuel",male
429,958,1,"Burns, Miss. Mary Delia",female
430,1272,0,"O'Connor, Mr. Patrick",male
431,18955,1,NaN,NaN
432,1040,0,"Crafton, Mr. John Bertram",male

In [30]:
len(df_ids)

433

![title](./pic/merging/left_join/4_pid.png)

<br>

---

## Merge function: `left_join` mit `left_on=` & `right_on=`

![title](./pic/merging/left_join/5_left_olor.png)

In [26]:
df_passenger.rename({'PassengerId': 'pass_id'}, axis=1, inplace=True)
df_passenger.head()

   pass_id                                       Name     Sex
0      935      Corbett, Mrs. Walter H (Irene Colvin)  female
1     1023                  Gracie, Col. Archibald IV    male
2     1136  Johnston, Master. William Arthur Willie""    male
3     1044                         Storey, Mr. Thomas    male
4      954               Bjorklund, Mr. Ernst Herbert    male

In [13]:
#pd.merge(df_ids,
#         df_passenger,
#         how='inner',
#         on='PassengerId'
#         )

In [28]:
pd.merge(df_ids,
         df_passenger,
         how='left',
         left_on='PassengerId',
         right_on='pass_id'
         )

,PassengerId,Survived,pass_id,Name,Sex
0,1297,0,1297.0,"Nourney, Mr. Alfred (Baron von Drachstedt"")""",male
1,1260,1,1260.0,"Gibson, Mrs. Leonard (Pauline C Boeson)",female
2,1153,0,1153.0,"Nilsson, Mr. August Ferdinand",male
3,1139,0,1139.0,"Drew, Mr. James Vivian",male
4,998,0,998.0,"Buckley, Mr. Daniel",male
...,...,...,...,...,...
428,1149,0,1149.0,"Niklasson, Mr. Samuel",male
429,958,1,958.0,"Burns, Miss. Mary Delia",female
430,1272,0,1272.0,"O'Connor, Mr. Patrick",male
431,18955,1,NaN,NaN,NaN
432,1040,0,1040.0,"Crafton, Mr. John Bertram",male